# Core
brew "stow"

# Shell
brew "zsh"
brew "zoxide"
brew "starship"
brew "eza"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Terminal
cask "ghostty"
cask "font-jetbrains-mono-nerd-font"

# Window Manager
cask "nikitabobko/tap/aerospace"

# Status Bar
tap "FelixKratz/formulae"
brew "sketchybar"
cask "font-sketchybar-app-font"

# Text Editor
brew "neovim"

# Development
brew "openjdk@21"

# Terminal Multiplexer
brew "tmux"
